{
  "Certifications and Prizes": "Certifications and Prizes",
  "CertBachelor": "Bachelor of Science",
  "CertContentBachelor": "Graduating from HCM University of Science, Advanced Program in Computer Science.",
  "CertCom": "Communicative Certification: TOEFL ibt 85 pts",
  "CertContentComm": "The TOEFL iBT® test measures your ability to use and understand English at the university level. And it evaluates how well you combine your reading, listening, speaking and writing skills to perform academic tasks.",
  "CertSPrize": "Second place",
  "CertContentSPrize": "Got second prize for the competitive algorithm contest of the university.",
  "CertFPrize": "First place",
  "CertContentFPrize": "Highschool, got First prize for the competitive algorithm contest of the city.",
  "Name": "Phat Ho",
  "Job": "Fullstack Developer",
  "english": "english",
  "vietnamese": "vietnamese",
  "Menu": "Menu",
  "Home": "Home",
  "About": "About",
  "Welcome": "Hi Folks, Welcome to my Porfolio !!!",
  "Welcome-short": "Welcome :)",
  "Experiences": "Experiences",
  "Certifications": "Certifications",
  "Projects": "Projects",
  "Contacts": "Contacts",
  "About me": "About me",
  "About Me: Subtext": "Yikes!! Skip it if you&apos;re bored!!",
  "About me: Card Info Mobile Verse 1": "Fullstack Software Engineer. 5+ years of algorithm background since high school. 4+ years of experience specializing in frontend/backend development, infras‐ tructure automation, and microservices. Interested in devising a better problem‐solving method for challenging tasks, and learning new technologies and tools if the need arises.",
  "About me: Card Info Verse 1": "Fullstack Software Engineer. 5+ years of algorithm background since high school. 4+ years of experience specializing in frontend/backend development, infras‐ tructure automation, and microservices. Interested in devising a better problem‐solving method for challenging tasks, and learning new technologies and tools if the need arises. With a wide range of experiences in web framework backing up by 5 years of pursuing the competitive programming, I have the confidence that I can adapt to any languages, frameworks, or complicated system in a short period of time. I am a fast-learner and can be in charge the role of team leader when push comes to shove. On the other hand, I can communicate effectively in English as my secondary language.",
  "About me: Card Info Quote": "Where there&apos;s a will, there&apos;s a way",
  "About me: Card Info Verse 2": "I have the believe that all the problems in the world will be solved as long as you keep the positive mental attitude and a cold head.",
  "About me: Current status": "Available for Freelance job",
  "Contact: Header 1": "Contact information?",
  "Contact: Header 2": "My pleasure to meet you!!",
  "Contact: Description 1": "Do you need a professional for lending a hand?",
  "Contact: Description 2": "Are you facing unfathomable problem?",
  "Contact: Info Name": "Phat Ho",
  "Contact: Info Role": "Fullstack Developer",
  "Contact: Info Country": "VietNam",
  "Contact: Info Dist": "Dist 1, Ho Chi Minh City",
  "Exp: Title": "Experiences",
  "Exp: SubTitle": "Current and Past Jobs",
  "Exp: Zalora Title": "ZALORA GROUP",
  "Exp: Zalora Role": "Fullstack Software Engineer",
  "Exp: Zalora Desc": "Owning, maintaining and developing features for Zalora website on mobile devices in 6 countries. Working with state‐of‐the‐art search engine in order to ensure that every search query in Zalora delivering meaningful and helpful results for customers.",
  "Exp: Zalora Extra": "<p><strong>LITE (WEB MOBiLE)</strong></p><p><strong>Tech Stack: React CRA, Redux, Travis, DangerJS, BundleSize, Terraform, AWS</strong></p><p><ul><li><span>Optimized service worker so that it worked for 6 countries and for 3 environments (instance/staging/production) without conflicting</span></li><li> <span>Moved building process from Jenkins to AWS Codebuild and optimized building/deploying pipeline for releasing to production</span></li><li><span>Rewrited Proxy to enable easy development from any environments</span></li><li><span>Optimized/Filtered noise in error logs in Sentry</span></li><li><span>Optimized bundle size under 150KB for main and 32KB for other chunks</span></li><li><span>Added/Fixed proper eslint rule for the whole project</span></li><li><span>Built bot instance with AWS Lambda to help QA/Dev to deploy ticket easily to instance environment</span> </li></ul></p><p><strong>COSTA</strong></p><p><strong>Tech Stack: Golang, Docker, Solr, AWS ECS, Newrelic, Sentry, Grafana, AWS Cloudwatch</strong></p><p><ul><li><span>Supported A/B testing for Learning to Ranks with Solr, third party Datajet, and many other features</span></li><li><span>Reduced error rate on Newrelic to less than 1%</span></li><li><span>Helped to improve caching with in‐memory</span></li><li><span>Moved Costa architecture from in‐place deployment EC2 to ECS blue‐green deployment</span></li><li><span>Supported to refine errors and logging in Newrelic and Sentry</span></li></ul></p>",
  "Exp: Zalora Skill": "Technical skills: ReactJS(CRA), Golang, Solr, Amazon Web Service, Terraform.",
  "Exp: Zalora Dates": "10/2019 – now",
  "Exp: Dek Title": "DEK Technologies",
  "Exp: Dek Role": "Fullstack Software Engineer",
  "Exp: Dek Desc": "At DEK, I’m in charge of developing an web application helping users to have a good visualization about the statistics of test cases executed by Jenkin. Also, I take the responsibility for investigating, fixing bugs and play a role of a Scrum Master in order to assist others completing their job.",
  "Exp: Dek Skill": "Technical skills: Ymer, Nodejs, Docker, Kafka Confluence, EFK, Kubernetes, Jenkins, Cassandra",
  "Exp: Dek Extra": "<p><strong>DaVis</strong></p><ul><li><span>Helped Scrum master to facilitate team, and came up with a solution to improve team performance</span></li><li><span>Maintained and developed feature for Davis, a visualization tool helping people to have a statistic view of test cases executed by Jenkins.</span></li><li><span>Launched and built Kafka connectors to actively pull the result from Jenkins using XPATH selectors and send the records to a Kafka cluster by interval.</span></li><li><span>Researched optimizing backend data query time using hadoop HDFS + Apache Hive and compared with Cassandra.</span></li><li><span>Deployed Kafka Confluence and Davis application (frontend + backend) to the provided Kubernetes cloud service.</span></li><li><span>Developed a Logging system from a local machine using EFK stack (Elasticsearch, FluentD, Kibana), deployed also in Kubernetes</span></li><li><span>Set up CI system using Jenkins and Gerrit and improve coverage of the source connector project to nearly 100% by refactoring project structure and adding Unit tests</span></li></ul>",
  "Exp: Dek Dates": "4/2018 – 10/2019",
  "Exp: GCS Title": "GCS - Industrial Printing",
  "Exp: GCS Role": "Fresher",
  "Exp: GCS Desc": "<ul><li>Maintained and developed new features for the desktop application project helping to operate industrial printing machines using Java Swing.</li><li>Drew a design diagram, writing test cases, fixed bugs on development tracks, and customer&rsquo;s requests.</li><li>Worked closely with SE,QA,PM to resolve issues raised by customers asap.</li></ul>",
  "Exp: GCS Skill": "Technical skills: Java, Java Swing, UML Designs, Maintenance System",
  "Exp: GCS Dates": "7/2017 – 4/2018",
  "Exp: GCS-intern Role": "Intern",
  "Exp: GCS-intern Title": "GCS - Surveillance System",
  "Exp: GCS-intern Desc": "<ul><li>Developed the surveillance system using Spring MVC framework in combination with Hibernate and PostgreSQL. The system will display recorded images from the camera after running them through the CV algorithm.</li><li>Worked as the core member of the team and helped to build the project structure from the beginning.</li><li>Presented the demo of the project to stakeholders and clients by the end of each sprint.</li></ul>",
  "Exp: GCS-intern Skill": "Technical skills: Spring MVC, Java, Hibernate, PostgreSQL, HTML/CSS, JQuery, JS, Thymeleaf.",
  "Exp: GCS-intern Dates": "6/2016 – 10/2016",
  "SideProjects: Title": "Side Projects",
  "SideProjects: SubTitle": "Side Project jobs",
  "Exp: Portfolio Title": "Porfolio",
  "Exp: Portfolio Desc": "As a web developer, everyone needs for himself a real portfolio for others to look into. In my free time, I decided to build my portfolio project from scratch using the technology that I know best ReactJS and Spring MVC. The project was designed with a front-end to show case my CV, and the back end was under-developing with Spring MVC.",
  "Exp: Portfolio Skill": "Technical skills: ReactJS, NextJS, Spring MVC/ Gradle, DangerJS, CircleCI, Eslint, Now",
  "Exp: Portfolio Dates": "11/2019 – now",
  "Exp: LiveGuess Title": "Live Guess",
  "Exp: LiveGuess Desc": "During my free time, I’m in charge of a freelance team to develop a Real-time Web Application using ReactJs + Webpack. The project was using pulling model, to pull data continuously from a back-end to give users a real-time experience. The application was delivered by Docker, and build into multiple platforms Android and IOS with Apache Cordova.",
  "Exp: LiveGuess Skill": "Technical skills: React/Redux, Docker, NodeJS, Webpack, Apache Cordova.",
  "Exp: LiveGuess Dates": "3/2019 – 5/2019",
  "Exp: SmartApp Title": "SmartApp Technology",
  "Exp: SmartApp Desc": "Working on the multi-platform framework Angular-JS, I handle the task of developing the application to summarize agency’s information from Masan company as the report for higher executive in the line to review and analyze.",
  "Exp: SmartApp Skill": "Technical skills: Angular-JS, HTML/CSS, JQuery.",
  "Exp: SmartApp Dates": "2/2017 – 5/2017",
  "Exp: Brand360 Title": "Brand360",
  "Exp: Brand360 Desc": "As a team leader, I operate the team to develop a web for Brand 360 company inorder to broadcast their images in Viet Nam. The idea is to use Wordpress template in order to have a fast and user-friendly web/admin UI.",
  "Exp: Brand360 Skill": "Technical skills: Wordpress template, HTML, CSS, JS.",
  "Exp: Brand360 Dates": "2/2016 – 5/2016",
  "Project: Title": "Projects",
  "Project: SubTitle": "Something cool to look back!!!",
  "Blogs": "Blogs",
  "See more": "See more"
}
