{
  "Certifications and Prizes": "Certifications and Prizes",
  "CertBachelor": "Bachelor of Science",
  "CertContentBachelor": "Graduating from HCM University of Science, Advanced Program in Computer Science.",
  "CertCom": "Communicative Certification: TOEFL ibt 85 pts",
  "CertContentComm": "The TOEFL iBT® test measures your ability to use and understand English at the university level. And it evaluates how well you combine your reading, listening, speaking and writing skills to perform academic tasks.",
  "CertSPrize": "Second place",
  "CertContentSPrize": "Got second prize for the competitive algorithm contest of the university.",
  "CertFPrize": "First place",
  "CertContentFPrize": "Highschool, got First prize for the competitive algorithm contest of the city.",
  "Name": "Phat Ho",
  "Job": "Fullstack Developer",
  "english": "english",
  "vietnamese": "vietnamese",
  "Menu": "Menu",
  "Home": "Home",
  "About": "About",
  "Welcome": "Hi Folks, Welcome to my Porfolio !!!",
  "Welcome-short": "Welcome :)",
  "Experiences": "Experiences",
  "Certifications": "Certifications",
  "Projects": "Projects",
  "Contacts": "Contacts",
  "About me": "About me",
  "About Me: Subtext": "Yikes!! Skip it if you&apos;re bored!!",
  "About me: Card Info Verse 1": "Fullstack Software Engineer. 5+ years of algorithm background since high school. 4+ years of experience specializing in frontend/backend development, infras‐ tructure automation, and microservices. Super music‐nerd who loves Rock, Metal and enjoys playing around with the latest technologies while listening to music. Interested in devising a better problem‐solving method for challenging tasks, and learning new technologies and tools if the need arises.",
  "About me: Card Info Quote": "Where there&apos;s a will, there&apos;s a way",
  "About me: Card Info Verse 2": "I have the believe that all the problems in the world will be solved as long as you keep the positive mental attitude and a cold head.",
  "About me: Current status": "Available for Freelance job",
  "Contact: Header 1": "Contact information?",
  "Contact: Header 2": "My pleasure to meet you!!",
  "Contact: Description 1": "Do you need a professional for lending a hand?",
  "Contact: Description 2": "Are you facing unfathomable problem?",
  "Contact: Info Name": "Phat Ho",
  "Contact: Info Role": "Fullstack Developer",
  "Contact: Info Country": "VietNam",
  "Contact: Info Dist": "Dist 1, Ho Chi Minh City",
  "Why me: Title": "Why me?",
  "Why me: Quote": "A wide range of experiences in web framework backing up by 5 years of pursuing the competitive programming, I have the confidence that I can adapt to any languages, frameworks, or complicated system in a short period of time. I am a fast-learner and can be in charge the role of team leader when push comes to shove. On the other hand, I can communicate effectively in English as my secondary language, so the barrier of language is no longer a big threat. I am dedicated and will strive to make a profit for the team.",
  "Exp: Title": "Experiences",
  "Exp: SubTitle": "Current and Past Jobs",
  "Exp: Zalora Title": "ZALORA GROUP",
  "Exp: Zalora Desc": "At Zalora, I’m currently an owner of the web mobile application. I take full responsibility for the application life-cycle (developing, reviewing, releasing, deploying) for over six countries in Southeast Asia (Singapore, Malaysia, Philippine, Indonesia, Hong Kong, Taiwan). Besides, I also take part in developing a catalog/searching service for Zalora, which is one of the most critical part.",
  "Exp: Zalora Skill": "Technical skills: ReactJS(CRA), Golang, Solr, Amazon Web Service, Terraform.",
  "Exp: Zalora Dates": "10/2019 – now",
  "Exp: Dek Title": "DEK Technologies",
  "Exp: Dek Desc": "At DEK, I’m in charge of developing an web application helping users to have a good visualization about the statistics of test cases executed by Jenkin. Also, I take the responsibility for investigating, fixing bugs and play a role of a Scrum Master in order to assist others completing their job.",
  "Exp: Dek Skill": "Technical skills: HTML/CSS/Js, Node JS, Kafka(Confluent), Log Streaming ELK, Kubernetes",
  "Exp: Dek Dates": "4/2018 – 10/2019",
  "Exp: GCS Title": "GCS - Industrial Printing",
  "Exp: GCS Desc": "At Global Cybersoft, I am involved with maintaining and developing new features for an industrial printing process application on Desktops for a Japanese company. Generally, tasks including adding function, drawing design, writing test case and fixing bugs found from customers are my responsibilities.",
  "Exp: GCS Skill": "Technical skills: Java, Java Swing, UML Designs, Maintenance System",
  "Exp: GCS Dates": "7/2017 – 4/2018",
  "Exp: GCS-intern Title": "GCS - Surveillance System",
  "Exp: GCS-intern Desc": "Working as the web developer for the surveillance system project. Using Spring MVC framework, we build the admin web monitoring employee&apos;s status and fire alarm based on the help of Computer Vision Analytic.",
  "Exp: GCS-intern Skill": "Technical skills: Spring MVC, Java, Hibernate, PostgreSQL, HTML/CSS, JQuery, JS, Thymeleaf.",
  "Exp: GCS-intern Dates": "6/2016 – 10/2016",
  "SideProjects: Title": "Side Projects",
  "SideProjects: SubTitle": "Side Project jobs",
  "Exp: Portfolio Title": "Porfolio",
  "Exp: Portfolio Desc": "As a web developer, everyone needs for himself a real portfolio for others to look into. In my free time, I decided to build my portfolio project from scratch using the technology that I know best ReactJS and Spring MVC. The project was designed with a front-end to show case my CV, and the back end was under-developing with Spring MVC.",
  "Exp: Portfolio Skill": "Technical skills: ReactJS, NextJS, Spring MVC/ Gradle, DangerJS, CircleCI, Eslint, Now",
  "Exp: Portfolio Dates": "11/2019 – now",
  "Exp: LiveGuess Title": "Live Guess",
  "Exp: LiveGuess Desc": "During my free time, I’m in charge of a freelance team to develop a Real-time Web Application using ReactJs + Webpack. The project was using pulling model, to pull data continuously from a back-end to give users a real-time experience. The application was delivered by Docker, and build into multiple platforms Android and IOS with Apache Cordova.",
  "Exp: LiveGuess Skill": "Technical skills: React/Redux, Docker, NodeJS, Webpack, Apache Cordova.",
  "Exp: LiveGuess Dates": "3/2019 – 5/2019",
  "Exp: SmartApp Title": "SmartApp Technology",
  "Exp: SmartApp Desc": "Working on the multi-platform framework Angular-JS, I handle the task of developing the application to summarize agency’s information from Masan company as the report for higher executive in the line to review and analyze.",
  "Exp: SmartApp Skill": "Technical skills: Angular-JS, HTML/CSS, JQuery.",
  "Exp: SmartApp Dates": "2/2017 – 5/2017",
  "Exp: Brand360 Title": "Brand360",
  "Exp: Brand360 Desc": "As a team leader, I operate the team to develop a web for Brand 360 company inorder to broadcast their images in Viet Nam. The idea is to use Wordpress template in order to have a fast and user-friendly web/admin UI.",
  "Exp: Brand360 Skill": "Technical skills: Wordpress template, HTML, CSS, JS.",
  "Exp: Brand360 Dates": "2/2016 – 5/2016",
  "Project: Title": "Projects",
  "Project: SubTitle": "Something cool to look back!!!",
  "Blogs": "Blogs"
}
