{
  "Name": "Phat Ho",
  "Job": "Fullstack Developer",
  "english": "english",
  "vietnamese": "vietnamese",
  "Menu": "Menu",
  "Home": "Home",
  "About": "About",
  "Experiences": "Experiences",
  "Certifications": "Certifications",
  "Projects": "Projects",
  "Contacts": "Contacts",
  "About me": "About me",
  "About Me: Subtext": "Well skip it if you&apos;re bored!!",
  "About me: Card Info Verse 1": "Exposing to problem solving at a very young age, I passionate with disentangling sticky situations that can be occured in software engineer as well as real life. My little hobby is to find solution for competitive problems using optimized algorithm. I also have great interest in software architecture, and always seek to learn new things. Down to earth, I am human. I do find it interested to go cycling, jogging, reading books, listen to music, and stuffs that a normal human being would love to do.",
  "About me: Card Info Quote": "Where there&apos;s a will, there&apos;s a way",
  "About me: Card Info Verse 2": "I have the believe that all the problems in the world will be solved as long as you keep the positive mental attitude and a cold head.",
  "About me: Current status": "Available for Freelance job",
  "Contact: Header 1": "Contact information?",
  "Contact: Header 2": "My pleasure to meet you!!",
  "Contact: Description 1": "Do you need a professional for lending a hand?",
  "Contact: Description 2": "Are you facing unfathomable problem?",
  "Contact: Info Name": "Phat Ho",
  "Contact: Info Role": "Fullstack Developer",
  "Contact: Info Country": "VietNam",
  "Contact: Info Dist": "Dist 1, Ho Chi Minh City",
  "Why me: Title": "Why me?",
  "Why me: Quote": "A wide range of experiences in web framework backing up by 5 years of pursuing the competitive programming, I have the confidence that I can adapt to any languages, frameworks, or complicated system in a short period of time. I am a fast-learner and can be in charge the role of team leader when push comes to shove. On the other hand, I can communicate effectively in English as my secondary language, so the barrier of language is no longer a big threat. I am dedicated and will strive to make a profit for the team.",
  "Exp: Dek Title": "DEK Technologies",
  "Exp: Dek Desc": "At DEK, I’m in charge of developing an web application helping users to have a good visualization about the statistics of test cases executed by Jenkin. Also, I take the responsibility for investigating, fixing bugs and assisting others completing their job.",
  "Exp: Dek Skill": "Technical skills: HTML/CSS/Js, Node JS, Spark, Hive, Kafka Connector (Confluent), Kubernetes.",
  "Exp: YBA Title": "YBA Ben Tre",
  "Exp: YBA Desc": "As a team leader, I operate and assemble the team to develop a web for Youth Business Association of Ben Tre. The idea is to use Wordpress template in order to have a fast and user-friendly web/admin UI.",
  "Exp: YBA Skill": "Technical skills: Wordpress template, HTML, CSS, JS, Web Deployment.",
  "Exp: SmartApp Title": "SmartApp Technology",
  "Exp: SmartApp Desc": "Working on the multi-platform framework Angular-JS, I handle the task of developing the application to summarize agency’s information from Masan company as the report for higher executive in the line to review and analyze.",
  "Exp: SmartApp Skill": "Technical skills: Angular-JS, HTML/CSS, JQuery.",
  "Exp: GCS Title": "Global Cybersoft",
  "Exp: GCS Desc": "At Global Cybersoft, I am involved with maintaining and developing new features for windows-based software. Generally, tasks including adding function, drawing design, writing test case and fixing bugs found from customers are my responsibilities.",
  "Exp: GCS Skill": "Technical skills: Java, Java Swing, UML Designs, Maintenance System",
  "Exp: GCS-intern Title": "Global Cybersoft",
  "Exp: GCS-intern Desc": "Work as the web developer for the surveillance system project. Using Spring MVC framework, we build the admin web monitoring employee&apos;s status and fire alarm using Computer Vision Analytic.",
  "Exp: GCS-intern Skill": "Technical skills: Spring MVC, Java, Hibernate, PostgreSQL, HTML/CSS, JQuery, JS, Thymeleaf.",
  "Exp: Brand360 Title": "Brand360",
  "Exp: Brand360 Desc": "As a team leader, I operate the team to develop a web for Brand 360 company inorder to broadcast their images in Viet Nam. The idea is to use Wordpress template in order to have a fast and user-friendly web/admin UI.",
  "Exp: Brand360 Skill": "Technical skills: Wordpress template, HTML, CSS, JS."
}
