{
  "Name": "Hồ Hữu Phát",
  "Job": "Lập trình viên Fullstack",
  "english": "Tiếng Anh",
  "vietnamese": "Tiếng Việt",
  "Menu": "Mục lục",
  "Home": "Trang chủ",
  "About": "Về tôi",
  "Experiences": "Kinh nghiệm",
  "Certifications": "Chứng chỉ",
  "Projects": "Dự án",
  "Contacts": "Liên lạc",
  "About me": "Về mình",
  "About Me: Subtext": "Bạn có thể bỏ qua nếu thích :P",
  "About me: Card Info Verse 1": "Từ lớp 8 mình đã có cơ hội tiếp xúc nhiều với các ngôn ngữ lập trình, chẳng hạn như Pascal. Vì có xuất thân là dân chuyên tin nên thật sự mình rất thích việc lập trình giải thuật. Bây giờ thì mình không tiếp xúc nhiều với thuật toán nữa, mà hứng thú lớn nhất bây giờ là về Software Architect cùng với các công nghệ mới. Ngoài ra thì mình cũng như các bạn, thích coi manga, xem film, đọc truyện, đạp xe,...",
  "About me: Card Info Quote": "Có chí thì nên",
  "About me: Card Info Verse 2": "Mình xuất phát từ base số 0 (không biết gì về lập trình) cho tới khi đam mê nó, nên luôn tâm đắc 1 điều duy nhất này: có cố gắng thì sẽ nên chuyện.",
  "About me: Current status": "Có Job gì hay thì hú mình nha !!!",
  "Contact: Header 1": "Thông tin liên lạc?",
  "Contact: Header 2": "Thật vui khi bạn ghé qua!!",
  "Contact: Description 1": "Bạn có cần sự trợ giúp của một người chuyên nghiệp?",
  "Contact: Description 2": "Bạn đang đối mặt với một vấn đề không thể giải quyết nổi?",
  "Contact: Info Name": "Hồ Hữu Phát",
  "Contact: Info Role": "Lập trình viên Fullstack",
  "Contact: Info Country": "Việt Nam",
  "Contact: Info Dist": "Quận 1, Tp Hồ Chí Minh",
  "Why me: Title": "Tại sao là mình?",
  "Why me: Quote": "Với những kinh nghiệm thực tiễn dày dặn về xây dựng website cùng với 5 năm nghiên cứu về thi đấu giải thuật, mình tự tin rằng bản thân có thể làm được bất cứ ngôn ngữ hoặc framework bất kì trong một thời gian ngắn. Và vì vậy, mình là môt người học rất nhanh, và mình có thể nắm lấy vị trí leader nhóm khi cần thiết. Ngoài ra, mình tự tin rằng có thể giao tiếp Tiếng Anh một cách hiệu quả, vì thế không sợ khó khăn về mặt ngôn ngự khi giao tiếp với người nước ngoài. Mình luôn hướng tới tối ưu hoá trong công việc để mang tới lợi ích lớn nhất cho tất cả.",
  "Exp: Dek Title": "DEK Technologies",
  "Exp: Dek Desc": "At DEK, I’m in charge of developing an web application helping users to have a good visualization about the statistics of test cases executed by Jenkin. Also, I take the responsibility for investigating, fixing bugs and assisting others completing their job.",
  "Exp: Dek Skill": "Technical skills: HTML/CSS/Js, Node JS, Spark, Hive, Kafka Connector (Confluent), Kubernetes.",
  "Exp: YBA Title": "YBA Ben Tre",
  "Exp: YBA Desc": "As a team leader, I operate and assemble the team to develop a web for Youth Business Association of Ben Tre. The idea is to use Wordpress template in order to have a fast and user-friendly web/admin UI.",
  "Exp: YBA Skill": "Technical skills: Wordpress template, HTML, CSS, JS, Web Deployment.",
  "Exp: SmartApp Title": "SmartApp Technology",
  "Exp: SmartApp Desc": "Working on the multi-platform framework Angular-JS, I handle the task of developing the application to summarize agency’s information from Masan company as the report for higher executive in the line to review and analyze.",
  "Exp: SmartApp Skill": "Technical skills: Angular-JS, HTML/CSS, JQuery.",
  "Exp: GCS Title": "Global Cybersoft",
  "Exp: GCS Desc": "At Global Cybersoft, I am involved with maintaining and developing new features for windows-based software. Generally, tasks including adding function, drawing design, writing test case and fixing bugs found from customers are my responsibilities.",
  "Exp: GCS Skill": "Technical skills: Java, Java Swing, UML Designs, Maintenance System",
  "Exp: GCS-intern Title": "Global Cybersoft",
  "Exp: GCS-intern Desc": "Work as the web developer for the surveillance system project. Using Spring MVC framework, we build the admin web monitoring employee&apos;s status and fire alarm using Computer Vision Analytic.",
  "Exp: GCS-intern Skill": "Technical skills: Spring MVC, Java, Hibernate, PostgreSQL, HTML/CSS, JQuery, JS, Thymeleaf.",
  "Exp: Brand360 Title": "Brand360",
  "Exp: Brand360 Desc": "As a team leader, I operate the team to develop a web for Brand 360 company inorder to broadcast their images in Viet Nam. The idea is to use Wordpress template in order to have a fast and user-friendly web/admin UI.",
  "Exp: Brand360 Skill": "Technical skills: Wordpress template, HTML, CSS, JS."
}
