{
  "CertResearch": "Cử nhân Khoa Học Máy Tính",
  "CertContentResearch": "Tốt nghiệp chương trình nâng cao ngành Khoa Học Máy Tính, Đại học Khoa Học Tự Nhiên HCM.",
  "CertDevelop": "Chứng chỉ giao tiếp: TOEFL ibt 85 pts",
  "CertContentDevelop": "TOEFL iBT® để đo khả năng thành thạo tiếng anh theo trình độ đại học. Đồng thời đánh giá sự phối hợp nhuần nhuyễn khi bạn sử dụng 4 kỹ năng nghe, nói, đọc, viết để hoàn thành chương trình học thuật.",
  "CertDeploy": "Huy chương bạc",
  "CertContentDeploy": "Giành Huy chương bạc trong cuộc thi thuật toán của trường đại học.",
  "CertDeliver": "Huy chương vàng",
  "CertContentDeliver": "Giành Huy chương vàng trong cuộc thi thuật toán cấp thành phố khi còn học phổ thông.",
  "Name": "Hồ Hữu Phát",
  "Job": "Lập trình viên Fullstack",
  "english": "Tiếng Anh",
  "vietnamese": "Tiếng Việt",
  "Menu": "Mục lục",
  "Home": "Trang chủ",
  "About": "Về tôi",
  "Experiences": "Kinh nghiệm",
  "Certifications": "Chứng chỉ",
  "Projects": "Dự án",
  "Contacts": "Liên lạc",
  "About me": "Về mình",
  "About Me: Subtext": "Bạn có thể bỏ qua nếu thích :P",
  "About me: Card Info Verse 1": "Từ lớp 8 mình đã có cơ hội tiếp xúc nhiều với các ngôn ngữ lập trình, chẳng hạn như Pascal. Vì có xuất thân là dân chuyên tin nên thật sự mình rất thích việc lập trình giải thuật. Bây giờ thì mình không tiếp xúc nhiều với thuật toán nữa, mà hứng thú lớn nhất bây giờ là về Software Architect cùng với các công nghệ mới. Ngoài ra thì mình cũng như các bạn, thích coi manga, xem film, đọc truyện, đạp xe,...",
  "About me: Card Info Quote": "Có chí thì nên",
  "About me: Card Info Verse 2": "Mình xuất phát từ base số 0 (không biết gì về lập trình) cho tới khi đam mê nó, nên luôn tâm đắc 1 điều duy nhất này: có cố gắng thì sẽ nên chuyện.",
  "About me: Current status": "Có Job gì hay thì hú mình nha !!!",
  "Contact: Header 1": "Thông tin liên lạc?",
  "Contact: Header 2": "Thật vui khi bạn ghé qua!!",
  "Contact: Description 1": "Bạn có cần sự trợ giúp của một người chuyên nghiệp?",
  "Contact: Description 2": "Bạn đang đối mặt với một vấn đề không thể giải quyết nổi?",
  "Contact: Info Name": "Hồ Hữu Phát",
  "Contact: Info Role": "Lập trình viên Fullstack",
  "Contact: Info Country": "Việt Nam",
  "Contact: Info Dist": "Quận 1, Tp Hồ Chí Minh",
  "Why me: Title": "Tại sao là mình?",
  "Why me: Quote": "Với những kinh nghiệm thực tiễn dày dặn về xây dựng website cùng với 5 năm nghiên cứu về thi đấu giải thuật, mình tự tin rằng bản thân có thể làm được bất cứ ngôn ngữ hoặc framework bất kì trong một thời gian ngắn. Và vì vậy, mình là môt người học rất nhanh, và mình có thể nắm lấy vị trí leader nhóm khi cần thiết. Ngoài ra, mình tự tin rằng có thể giao tiếp Tiếng Anh một cách hiệu quả, vì thế không sợ khó khăn về mặt ngôn ngự khi giao tiếp với người nước ngoài. Mình luôn hướng tới tối ưu hoá trong công việc để mang tới lợi ích lớn nhất cho tất cả.",
  "Exp: Title": "Kinh Nghiệm",
  "Exp: SubTitle": "Công việc và Dự án",
  "Exp: Dek Title": "DEK Technologies",
  "Exp: Dek Desc": "Ở DEK, mình giữ vai trò xây dựng một trang web giúp cho người dùng có thể quan sát rõ hơn các dữ liệu thông tin về các testcases được xử lí từ Jenkins. Mình đảm nhận vai trò tìm hiểu, sửa lỗi, xây dựng hệ thống và giữ vai trò như mọi Scrum Master nhằm giúp đỡ mọi người để hoàn thành công việc tốt hơn.",
  "Exp: Dek Skill": "Kĩ thuật: HTML/CSS/Js, Node JS, Kafka(Confluent), Log Streaming ELK, Kubernetes.",
  "Exp: YBA Title": "YBA Bến Tre",
  "Exp: YBA Desc": "Trên vị trí là team leader, mình tổ chức một nhóm để xây dựng trang web cho Hội doanh nhân trẻ tỉnh Bến Tre. Với những yêu cầu để xây dựng 1 trang web nhanh và có giao diện để hỗ trợ cho người dùng. Với dự án này, Wordpress vẫn là một giải pháp hàng đầu được mình lựa chọn để xây dựn sản phẩm.",
  "Exp: YBA Skill": "Kĩ thuật: Wordpress template, HTML, CSS, JS, Web Deployment.",
  "Exp: SmartApp Title": "SmartApp Technology",
  "Exp: SmartApp Desc": "Làm việc trên một framework hỗ trợ cho hệ thống đa nền tảng là Angular-JS, mình đảm nhận phát triển một phần mềm để thống kê thông tin của các nhân viên bán hàng từ công ty Masan. Đồng thời, thống kê số liệu để xuất ra báo cáo cho ban lãnh đạo để phân tích và đánh giá.",
  "Exp: SmartApp Skill": "Kĩ thuật: Angular-JS, HTML/CSS, JQuery.",
  "Exp: GCS Title": "GCS - Quản lý dây chuyền in ấn",
  "Exp: GCS Desc": "Ở Global Cybersoft, mình đảm nhận nhiệm vụ để duy trì và phát triển tính năng mới cho phần mềm điều khiển chuỗi quy trình trong máy in công nghiệp. Nhìn chung thì mình làm những nhiệm vụ liên quan về thêm chức năng, vẽ design, viết test case và sửa lỗi phần mềm được báo từ người dùng.",
  "Exp: GCS Skill": "Kĩ thuật: Java, Java Swing, UML Designs, Maintenance System",
  "Exp: GCS-intern Title": "GCS - Quản trị hệ thống An ninh",
  "Exp: GCS-intern Desc": "Ở Global Cybersoft, mình có một dự án sản phẩm làm về hệ thống an ninh theo dõi sử dụng Spring MVC framework. Mình xây dựng một sản phẩm web dành cho những người quản trị hệ thống an ninh sử dụng để quan sát nhân viên và theo dõi những báo động từ văn phòng, nhờ thuật toán Computer Vision.",
  "Exp: GCS-intern Skill": "Kĩ thuật: Spring MVC, Java, Hibernate, PostgreSQL, HTML/CSS, JQuery, JS, Thymeleaf.",
  "Exp: Brand360 Title": "Brand360",
  "Exp: Brand360 Desc": "Trên vị trí là team leader, mình tổ chức một nhóm để xây dựng trang web cho công ty Brand 360 để quảng bá hình ảnh của họ ở Việt Nam. Ý tưởng chung là xây dựng trang web dựa trên Wordpress để xây dựng nhanh và công cấp cho người dùng một giao diện thân thiện để điều phối trang web.",
  "Exp: Brand360 Skill": "Kĩ thuật: Wordpress template, HTML, CSS, JS.",
  "Project: Title": "Dự án",
  "Project: SubTitle": "Một vài kỉ niệm để nhìn lại!!!"
}
