{
  "Certifications and Prizes": "Chứng chỉ và giải thưởng",
  "CertBachelor": "Cử nhân Khoa Học Máy Tính",
  "CertContentBachelor": "Tốt nghiệp chương trình nâng cao ngành Khoa Học Máy Tính, Đại học Khoa Học Tự Nhiên HCM.",
  "CertCom": "Chứng chỉ giao tiếp: TOEFL ibt 85 pts",
  "CertContentComm": "TOEFL iBT® để đo khả năng thành thạo tiếng anh theo trình độ đại học. Đồng thời đánh giá sự phối hợp nhuần nhuyễn khi bạn sử dụng 4 kỹ năng nghe, nói, đọc, viết để hoàn thành chương trình học thuật.",
  "CertSPrize": "Huy chương bạc",
  "CertContentSPrize": "Giành Huy chương bạc trong cuộc thi thuật toán của trường đại học.",
  "CertFPrize": "Huy chương vàng",
  "CertContentFPrize": "Giành Huy chương vàng trong cuộc thi thuật toán cấp thành phố khi còn học phổ thông.",
  "Name": "Phát Hồ",
  "Job": "Lập trình viên Fullstack",
  "english": "Tiếng Anh",
  "vietnamese": "Tiếng Việt",
  "Menu": "Mục lục",
  "Home": "Trang chủ",
  "About": "Về tôi",
  "Welcome": "Wecolme các bạn đến với porfolio của mình !!!",
  "Welcome-short": "Xin chào :)",
  "Experiences": "Kinh nghiệm",
  "Certifications": "Chứng chỉ",
  "Projects": "Dự án",
  "Contacts": "Liên lạc",
  "About me": "Tự sự",
  "About Me: Subtext": "Đôi điều về bản thân",
  "About me: Card Info Mobile Verse 1": "Là một lập trình viên Fullstack với hơn 5 năm kinh nghiệm về lập trình thuật toán từ trung học cơ sở, và hơn 4 năm kinh nghiệm chuyên môn hoá với lập trình web, CI/CD, IAC, và microservices. Mình cực kì hứng thú với việc nghiên cứu nhiều công nghệ và công cụ lập trình mới và suy nghĩ về nhiều cách để cải tiến hoàn thiện phần mềm và quy trình phần mềm.",
  "About me: Card Info Verse 1": "Là một lập trình viên Fullstack với hơn 5 năm kinh nghiệm về lập trình thuật toán từ trung học cơ sở, và hơn 4 năm kinh nghiệm chuyên môn hoá với lập trình web, CI/CD, IAC, và microservices. Mình cực kì hứng thú với việc nghiên cứu nhiều công nghệ và công cụ lập trình mới và suy nghĩ về nhiều cách để cải tiến hoàn thiện phần mềm và quy trình phần mềm. Với những kinh nghiệm thực tiễn dày dặn về xây dựng website cùng với 5 năm nghiên cứu về thi đấu giải thuật, mình tự tin rằng bản thân có thể làm được bất cứ ngôn ngữ hoặc framework bất kì trong một thời gian ngắn. Và vì vậy, mình là môt người học rất nhanh, và mình có thể nắm lấy vị trí leader nhóm khi cần thiết. Ngoài ra, mình tự tin rằng có thể giao tiếp Tiếng Anh một cách hiệu quả.",
  "About me: Card Info Quote": "Có chí thì nên",
  "About me: Card Info Verse 2": "Mình xuất phát từ base số 0 (không biết gì về lập trình) cho tới khi đam mê nó, nên luôn tâm đắc 1 điều duy nhất này: có cố gắng thì sẽ nên chuyện.",
  "About me: Current status": "Có Job gì hay thì hú mình nha !!!",
  "Contact: Header 1": "Thông tin liên lạc?",
  "Contact: Header 2": "Thật vui khi bạn ghé qua!!",
  "Contact: Description 1": "Bạn có cần sự trợ giúp của một người chuyên nghiệp?",
  "Contact: Description 2": "Bạn đang đối mặt với một vấn đề không thể giải quyết nổi?",
  "Contact: Info Name": "Hồ Hữu Phát",
  "Contact: Info Role": "Lập trình viên Fullstack",
  "Contact: Info Country": "Việt Nam",
  "Contact: Info Dist": "Quận 1, Tp Hồ Chí Minh",
  "Exp: Title": "Kinh Nghiệm",
  "Exp: SubTitle": "Công việc và Dự án",
  "Exp: Zalora Title": "Zalora Technologies",
  "Exp: Zalora Role": "Fullstack Software Engineer",
  "Exp: Zalora Desc": "Ở Zalora, mình giữ vai trò xây dựng trang web Zalora phiên bản trên điện thoại được sử dụng trên 6 quốc gia khắp Đông Nam Á (Singapore, Malaysia, Phillipine, Indonesia, Hong Kong, Taiwan). Đồng thời, mình tham gia hỗ trợ mọi người trong team để phát triển chức năng tìm kiếm cho Zalora, một trong những chức năng quan trọng và góp phần làm nên sự thành công cho Zalora.",
  "Exp: Zalora Skill": "Kĩ thuật: ReactJS(CRA), Golang, Solr, Amazon Web Service, Terraform.",
  "Exp: Zalora Dates": "10/2019 – Hiện tại",
  "Exp: Dek Title": "DEK Technologies",
  "Exp: Dek Desc": "Ở DEK, mình giữ vai trò xây dựng một trang web giúp cho người dùng có thể quan sát rõ hơn các dữ liệu thông tin về các testcases được xử lí từ Jenkins. Mình đảm nhận vai trò tìm hiểu, sửa lỗi, xây dựng hệ thống và giữ vai trò như mọi Scrum Master nhằm giúp đỡ mọi người để hoàn thành công việc tốt hơn.",
  "Exp: Dek Role": "Fullstack Software Engineer",
  "Exp: Dek Skill": "Kĩ thuật: Ymer, Nodejs, Docker, Kafka Confluence, EFK, Kubernetes, Jenkins, Cassandra.",
  "Exp: Dek Dates": "4/2018 – 10/2019",
  "Exp: GCS Title": "GCS - Quản lý dây chuyền in ấn",
  "Exp: GCS Desc": "Ở Global Cybersoft, mình đảm nhận nhiệm vụ để duy trì và phát triển tính năng mới cho phần mềm điều khiển chuỗi quy trình trong máy in công nghiệp. Nhìn chung thì mình làm những nhiệm vụ liên quan về thêm chức năng, vẽ design, viết test case và sửa lỗi phần mềm được báo từ người dùng.",
  "Exp: GCS Role": "Fresher",
  "Exp: GCS Dates": "7/2017 – 4/2018",
  "Exp: GCS Skill": "Kĩ thuật: Java, Java Swing, UML Designs, Maintenance System",
  "Exp: GCS-intern Title": "GCS - Quản lý hệ thống An ninh",
  "Exp: GCS-intern Role": "Intern",
  "Exp: GCS-intern Desc": "Ở Global Cybersoft, mình có một dự án sản phẩm làm về hệ thống an ninh theo dõi sử dụng Spring MVC framework. Mình xây dựng một sản phẩm web dành cho những người quản trị hệ thống an ninh sử dụng để quan sát nhân viên và theo dõi những báo động từ văn phòng, nhờ thuật toán Computer Vision.",
  "Exp: GCS-intern Skill": "Kĩ thuật: Spring MVC, Java, Hibernate, PostgreSQL, HTML/CSS, JQuery, JS, Thymeleaf.",
  "Exp: GCS-intern Dates": "6/2016 – 10/2016",
  "SideProjects: Title": "Dự án cá nhân",
  "SideProjects: SubTitle": "Vài lần đi đêm...",
  "Exp: Portfolio-FE Title": "Porfolio",
  "Exp: Portfolio-FE Desc": "Trong thời gian rảnh, mình có tự tìm tòi và xây dựng cho bản thân 1 website để mọi người có thể vào xem và contact khi cần. Dự án này được xây dựng với 2 phần, một phần front-end sử dụng nextjs được deploy trên trang mọi người đang xem. Project về back-end đang trong quá trình xây dựng để phục vụ cho việc viết blog trong tương lai.",
  "Exp: Portfolio-FE Skill": "Kĩ thuật: Nextjs, DangerJS, CircleCI, Vercel, Lighthouse, Scrutinizer",
  "Exp: Portfolio-FE Dates": "11/2019 – Hiện tại",
  "Exp: Portfolio-FE Role": "Owner",
  "Exp: Portfolio-BE Title": "Illuminati",
  "Exp: Portfolio-BE Desc": "Với dự án này, mình xây dựng một dự án dạng CMS để tạo và chỉnh sửa nội dung cho trang blog của trang web cá nhân. Dự án sử dụng Spring MVC để dựng nên hệ thống API và kết hợp với một frontend đi kèm được xây dựng bằng React CRA, để phục vụ cho việc tạo ra và chỉnh sửa dữ liệu một cách dễ dàng.",
  "Exp: Portfolio-BE Skill": "Kĩ thuật: Spring MVC, Java, Heroku, Swagger, Codecov, Gradle, React CRA, Redux, MongoDB",
  "Exp: Portfolio-BE Dates": "11/2019 – Hiện tại",
  "Exp: Portfolio-BE Role": "Owner",

  "Exp: BootCareer-FE Title": "Jobseeker dashboard",
  "Exp: BootCareer-FE Role": "Team Lead",
  "Exp: BootCareer-FE Desc": "Jobseeker là một trang web để hỗ trợ sinh viên sắp ra trường, những người đang muốn chuyển ngành, và những người đang trong khu vực bị ảnh hưởng mạnh mẽ bởi covid 19 tại Mĩ. Dự án sử dụng React CRA kết hợp với Material UI và được triển khai trên Netlify. Vai trò của mình là hỗ trợ mọi người xây dựng hệ thống tự động hoá cùng kiến trúc của toàn bộ dự án.",
  "Exp: BootCareer-FE Skill": "Kĩ thuật: React CRA, Redux Toolkit, Storybook, React Testing library, CircleCI, Netlify",
  "Exp: BootCareer-FE Dates": "08/2020 –  Hiện tại",
  "Exp: BootCareer-BE Title": "Jobseeker Userservice",
  "Exp: BootCareer-BE Role": "Team lead",
  "Exp: BootCareer-BE Desc": "Trong dự án này, mình giữ vai trò team lead để hỗ trợ cho mọi người trong đội xây dựng một hệ thống api để lưu giữ thông tin của người dùng của trang Jobseeker Dashboard. Lúc đầu hệ thống được xây dựng bằng javascript và express. Nhưng hiện tại mình đã hỗ trợ mọi người chuyển hết về ngôn ngữ Typescript cho cả dự án và thiết lập hệ thống tự động hoá với Terraform và Heroku.",
  "Exp: BootCareer-BE Skill": "Kĩ thuật: Typescript, Nodejs, Express, Toolkit, Eslint, Terraform, Github action, Heroku, MongoDB",
  "Exp: BootCareer-BE Dates": "08/2020  – Hiện tại",

  "Exp: LiveGuess Title": "Live Guess",
  "Exp: LiveGuess Role": "Freelance",
  "Exp: LiveGuess Desc": "Ngoài thời gian làm việc, mình từng có một dự án làm một phần mềm chạy trong thơi gian thực. Cơ bản là để tạo cho người dùng cảm giác thực, chương trình sẽ liên tục request lên back-end để lấy các phần data về. Phần mềm được deploy sử dụng Docker, và xây dựng ra nhiều phiên bản Android và IOS cho người dùng sử dụng Cordova Apache.",
  "Exp: LiveGuess Skill": "Kĩ thuật: React/Redux, Docker, NodeJS, Webpack, Apache Cordova.",
  "Exp: LiveGuess Dates": "3/2019 – 5/2019",

  "Exp: Popswap Title": "Popswap",
  "Exp: Popswap Desc": "Ở dự án này, mình tham gia bảo trì và xây dựng mới lại cho một ứng dụng trên điện thoại ở Sweden. Về phần kĩ thuật, dự án sử dụng React native để xây dựng ứng dụng trên cả Android và IOS. Mình góp phần xây dựng lại toàn bộ cấu trúc của ứng dụng, tái tổ chức lại giao diện và loại bỏ những phần mã code không dùng tới. Đồng thời xây dựng lại để ứng dụng có thể dễ dàng được bảo trì và xây dựng chức năng mới trong tương lai.",
  "Exp: Popswap Dates": "06/2020 – 09/2020",
  "Exp: Popswap Role": "Freelance",
  "Exp: Popswap Skill": "Kĩ thuật: React Native, Redux, Android, IOS",
 
  "Project: Title": "Dự án",
  "Project: SubTitle": "Một vài kỉ niệm để nhìn lại!!!",
  "Blogs": "Blogs",
  "See more": "Xem thêm",

  "###!!!!!!!!Deprecated": "Bellow text are not used anymore",
  "Exp: Brand360 Title": "Brand360",
  "Exp: Brand360 Desc": "Trên vị trí là team leader, mình tổ chức một nhóm để xây dựng trang web cho công ty Brand 360 để quảng bá hình ảnh của họ ở Việt Nam. Ý tưởng chung là xây dựng trang web dựa trên Wordpress để xây dựng nhanh và công cấp cho người dùng một giao diện thân thiện để điều phối trang web.",
  "Exp: Brand360 Skill": "Kĩ thuật: Wordpress template, HTML, CSS, JS.",
  "Exp: Brand360 Dates": "2/2016 – 5/2016",
  "Exp: SmartApp Title": "SmartApp Technology",
  "Exp: SmartApp Desc": "Làm việc trên một framework hỗ trợ cho hệ thống đa nền tảng là Angular-JS, mình đảm nhận phát triển một phần mềm để thống kê thông tin của các nhân viên bán hàng từ công ty Masan. Đồng thời, thống kê số liệu để xuất ra báo cáo cho ban lãnh đạo để phân tích và đánh giá.",
  "Exp: SmartApp Skill": "Kĩ thuật: Angular-JS, HTML/CSS, JQuery.",
  "Exp: SmartApp Dates": "2/2016 – 5/2016"
}
